app/controllers/morties_controller.rb

SELECT "morties".* FROM "morties"
---
    def index
        render json: Morty.all