app/controllers/ricks_controller.rb

SELECT "ricks".* FROM "ricks" WHERE "ricks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def authenticate
        token = request.headers["Authentication"].split(" ")[1]
        payload = decode(token)
        @user = Rick.find(payload["user_id"])