app/controllers/ricks_controller.rb

    def index
       render json: Rick.all
---
SELECT "ricks".* FROM "ricks"

    def login

      if Rick.all.find_by(name: params[:name])
          render json: Rick.all.find_by(name: params[:name])
---
SELECT "ricks".* FROM "ricks" WHERE "ricks"."name" = $1 LIMIT $2  [["name", ""], ["LIMIT", 1]]
SELECT "ricks".* FROM "ricks" WHERE "ricks"."name" = $1 LIMIT $2  [["name", "Mario"], ["LIMIT", 1]]

    def create
         newRick = Rick.find_or_create_by(name: params[:name], age: params[:age])
         newMorty = Morty.find_or_create_by(name:params[:mortyName],rick_id: newRick.id)
         if newRick
           rick = Rick.all.find_by(name: params[:name])
---
INSERT INTO "ricks" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test2"], ["age", 56], ["created_at", "2019-06-14 16:59:17.386327"], ["updated_at", "2019-06-14 16:59:17.386327"]]
SELECT "ricks".* FROM "ricks" WHERE "ricks"."name" = $1 AND "ricks"."age" = $2 LIMIT $3  [["name", "test2"], ["age", 56], ["LIMIT", 1]]
INSERT INTO "morties" ("name", "rick_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "MYMOrty"], ["rick_id", 12], ["created_at", "2019-06-14 16:59:17.410052"], ["updated_at", "2019-06-14 16:59:17.410052"]]
INSERT INTO "ricks" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Crazy"], ["age", 56], ["created_at", "2019-06-14 15:21:12.866027"], ["updated_at", "2019-06-14 15:21:12.866027"]]
SELECT "morties".* FROM "morties" WHERE "morties"."name" = $1 AND "morties"."rick_id" = $2 LIMIT $3  [["name", "MYMOrty"], ["rick_id", 12], ["LIMIT", 1]]
SELECT "ricks".* FROM "ricks" WHERE "ricks"."name" = $1 AND "ricks"."age" = $2 LIMIT $3  [["name", "Crazy"], ["age", 56], ["LIMIT", 1]]
SELECT "ricks".* FROM "ricks" WHERE "ricks"."name" = $1 LIMIT $2  [["name", "test2"], ["LIMIT", 1]]